Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеОНаличииСделокСАкциямиЭмитентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОповещениеОНаличииСделокСАкциямиЭмитентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеОНаличииСделокСАкциямиЭмитентов/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, 
		"Оповещение о наличии сделок с акциями эмитентов", 
		"0.08", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОНаличииСделокСАкциямиЭмитентовРЭМ",	"Оповещение о наличии сделок с акциями эмитентов РЭМ",,		Ложь,	"ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОНаличииСделокСАкциямиЭмитентовТраст",	"Оповещение о наличии сделок с акциями эмитентов Траст",,	Ложь,	"ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеОНаличииСделокСАкциямиЭмитентовРПИ",	"Оповещение о наличии сделок с акциями эмитентов РПИ",,		Ложь,	"ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "ОповещениеОНаличииСделокСАкциямиЭмитентов") = 1  Тогда
		
		ТД = ТекущаяДатаСеанса();
		
		// Обработка запускается только в рабочие дни по общеросссийскому календарю.
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТД) Тогда
			
			ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
			Получатели				= ПараметрыКоманды.Получатели;
			
			СписокЭмитентов = Новый Массив;
			СписокИменованныхОбъектовЭмитентов = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыКоманды.Эмитенты, ";", Истина, Истина);
			
			Если СписокИменованныхОбъектовЭмитентов.Количество() = 0 Тогда
				ЗарегистрироватьОшибку("Нет данных об эмитентах для проверки!");
				Возврат;
			КонецЕсли;
			
			Для Каждого ТекОбъект Из СписокИменованныхОбъектовЭмитентов Цикл
				ЭтотОбъект.Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект(ТекОбъект));
			КонецЦикла;
			
			// Обрабатываем все рабочие дни по календарю котировок с последнего рабочего дня по общероссийскому календарю.
			// Сегодняшний день не обрабатывается, т.к. не все документы могут быть разнесены.
			КонецПериода = НачалоДня(ТД - 86400);
			// Т.к. документы разносятся только в рабочие дни, то и первый проверяемый день определяем по общероссийскому календарю.
			НачалоПериода = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, КонецПериода);
			
			// Получаем массив торговых дней.
			// После обновления заменить на вызов метода модуля менеджера справочника Календари.
			ОбрабатываемыеДни = Справочники.Календари.ПолучитьРабочиеДниПериода(ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"), НачалоПериода, КонецПериода);
			
			// Формируем отчет по каждому торговому дню.
			Для Каждого ТекДень Из ОбрабатываемыеДни Цикл
				
				ЭтотОбъект.Период = ТекДень;
				
				ОповеститьОНаличииСделок(Получатели);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОНаличииСделок(Получатели) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЗаполнитьОтчет(ДокументРезультат);
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = "Оповещение о наличии сделок с акциями эмитентов " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", Получатели, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры

Процедура ЗаполнитьОтчет(ДокументРезультат) Экспорт
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала",		НачалоДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Эмитенты",		ЭтотОбъект.Эмитенты.ВыгрузитьЗначения());
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаДокумент.Ссылка КАК Ссылка,
		|	СделкаДокумент.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаДокумент.Дата КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|			ТОГДА УсловияСделок.ДатаПоставки
		|		ИНАЧЕ УсловияСделок.ДатаОплаты
		|	КОНЕЦ КАК ДатаРасчетов,
		|	СделкаДокумент.ВидСделки КАК ВидОперации,
		|	УсловияСделок.Рынок КАК Рынок,
		|	УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделок.Цена КАК Цена,
		|	УсловияСделок.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделок.Количество КАК Количество,
		|	УсловияСделок.Сумма + УсловияСделок.СуммаКупона КАК Сумма,
		|	0 КАК КоличествоДней,
		|	0 КАК Ставка,
		|	СделкаДокумент.ВалютаСделки КАК ВалютаСделки,
		|	СделкаДокумент.Ссылка КАК Основание,
		|	0 КАК ЧастьСделкиРЕПО
		|ПОМЕСТИТЬ _СделкиДокументы
		|ИЗ
		|	Документ.Сделка КАК СделкаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО СделкаДокумент.Ссылка = УсловияСделок.Регистратор
		|ГДЕ
		|	СделкаДокумент.Проведен
		|	И СделкаДокумент.Организация = &Организация
		|	И СделкаДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|	И УсловияСделок.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОДокумент.Ссылка,
		|	СделкаРЕПОДокумент.СчетДоверительногоУправления,
		|	СделкаРЕПОДокумент.Дата,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|			ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|			ТОГДА ВЫБОР
		|					КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""Покупка (РЕПО)""
		|					ИНАЧЕ ""Продажа (РЕПО)""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ""Продажа (РЕПО ч.2)""
		|				ИНАЧЕ ""Покупка (РЕПО ч.2)""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	УсловияСделокРЕПО.Рынок,
		|	УсловияСделокРЕПО.ЦеннаяБумага,
		|	УсловияСделокРЕПО.Цена,
		|	УсловияСделокРЕПО.ЦенаКупона,
		|	УсловияСделокРЕПО.Количество,
		|	УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|			ТОГДА 0
		|		КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА РАЗНОСТЬДАТ(УсловияСделокРЕПО.ДатаПоставки, СделкаРЕПОДокумент.ДатаПоставкиВторойЧасти, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(УсловияСделокРЕПО.ДатаПоставки, УсловияСделокРЕПО.ДатаВторойЧастиРЕПО, ДЕНЬ)
		|	КОНЕЦ,
		|	УсловияСделокРЕПО.СтавкаРЕПО,
		|	СделкаРЕПОДокумент.ВалютаСделки,
		|	СделкаРЕПОДокумент.Ссылка,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО СделкаРЕПОДокумент.Ссылка = УсловияСделокРЕПО.Регистратор
		|			И (СделкаРЕПОДокумент.ЧастьСделкиРЕПО < 2)
		|ГДЕ
		|	СделкаРЕПОДокумент.Проведен
		|	И СделкаРЕПОДокумент.Организация = &Организация
		|	И СделкаРЕПОДокумент.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УсловияСделокРЕПО.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|	И УсловияСделокРЕПО.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ДатаРасчетов,
		|	ВложенныйЗапрос.ВидОперации,
		|	ВложенныйЗапрос.Рынок,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.Цена - УсловияСделок.Цена,
		|	ВложенныйЗапрос.ЦенаКупона - УсловияСделок.ЦенаКупона,
		|	ВложенныйЗапрос.Количество - УсловияСделок.Количество,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКД - (УсловияСделок.Сумма + УсловияСделок.СуммаКупона),
		|	ВложенныйЗапрос.КоличествоДней,
		|	ВложенныйЗапрос.Ставка,
		|	ВложенныйЗапрос.ВалютаСделки,
		|	ВложенныйЗапрос.Основание,
		|	0
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияСделок.Период КАК Период,
		|		УсловияСделок.Регистратор КАК Регистратор,
		|		УсловияСделок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|				ТОГДА УсловияСделок.ДатаПоставки
		|			ИНАЧЕ УсловияСделок.ДатаОплаты
		|		КОНЕЦ КАК ДатаРасчетов,
		|		СделкаДокумент.ВидСделки КАК ВидОперации,
		|		УсловияСделок.Рынок КАК Рынок,
		|		УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Цена
		|		КОНЕЦ КАК Цена,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.ЦенаКупона
		|		КОНЕЦ КАК ЦенаКупона,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Количество
		|		КОНЕЦ КАК Количество,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Сумма + УсловияСделок.СуммаКупона
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКД,
		|		0 КАК КоличествоДней,
		|		0 КАК Ставка,
		|		СделкаДокумент.ВалютаСделки КАК ВалютаСделки,
		|		СделкаДокумент.Ссылка КАК Основание,
		|		МАКСИМУМ(УсловияСделокСрез.Период) КАК ПериодПоследнихУсловий
		|	ИЗ
		|		РегистрСведений.УсловияСделок КАК УсловияСделок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|			ПО (УсловияСделок.Активность)
		|				И УсловияСделок.Сделка = СделкаДокумент.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделокСрез
		|			ПО (УсловияСделокСрез.Активность)
		|				И УсловияСделок.Организация = УсловияСделокСрез.Организация
		|				И УсловияСделок.Сделка = УсловияСделокСрез.Сделка
		|				И УсловияСделок.Рынок = УсловияСделокСрез.Рынок
		|				И УсловияСделок.ЦеннаяБумага = УсловияСделокСрез.ЦеннаяБумага
		|				И УсловияСделок.Период > УсловияСделокСрез.Период
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(УсловияСделок.Регистратор) <> ТИП(Документ.Сделка)
		|		И УсловияСделок.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И УсловияСделок.Организация = &Организация
		|		И УсловияСделок.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|		И УсловияСделок.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияСделок.Период,
		|		УсловияСделок.Регистратор,
		|		УсловияСделок.СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|				ТОГДА УсловияСделок.ДатаПоставки
		|			ИНАЧЕ УсловияСделок.ДатаОплаты
		|		КОНЕЦ,
		|		СделкаДокумент.ВидСделки,
		|		УсловияСделок.Рынок,
		|		УсловияСделок.ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Цена
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.ЦенаКупона
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Количество
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Сумма + УсловияСделок.СуммаКупона
		|		КОНЕЦ,
		|		СделкаДокумент.ВалютаСделки,
		|		СделкаДокумент.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО (УсловияСделок.Активность)
		|			И ВложенныйЗапрос.ПериодПоследнихУсловий = УсловияСделок.Период
		|			И ВложенныйЗапрос.Основание = УсловияСделок.Сделка
		|			И ВложенныйЗапрос.Рынок = УсловияСделок.Рынок
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделок.ЦеннаяБумага
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ДатаРасчетов,
		|	ВложенныйЗапрос.ВидОперации,
		|	ВложенныйЗапрос.Рынок,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.Цена - УсловияСделокРЕПО.Цена,
		|	ВложенныйЗапрос.ЦенаКупона - УсловияСделокРЕПО.ЦенаКупона,
		|	ВложенныйЗапрос.Количество - УсловияСделокРЕПО.Количество,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКД - (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона),
		|	РАЗНОСТЬДАТ(ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО
		|		КОНЕЦ, ВложенныйЗапрос.ДатаВторойЧастиРЕПО, ДЕНЬ),
		|	ВложенныйЗапрос.Ставка,
		|	ВложенныйЗапрос.ВалютаСделки,
		|	ВложенныйЗапрос.Основание,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияСделокРЕПО.Период КАК Период,
		|		УсловияСделокРЕПО.Регистратор КАК Регистратор,
		|		УсловияСделокРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|		КОНЕЦ КАК ДатаРасчетов,
		|		ВЫБОР
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Покупка (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Продажа (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Продажа (РЕПО ч.2)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Покупка (РЕПО ч.2)""
		|		КОНЕЦ КАК ВидОперации,
		|		УсловияСделокРЕПО.Рынок КАК Рынок,
		|		УсловияСделокРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Цена
		|		КОНЕЦ КАК Цена,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.ЦенаКупона
		|		КОНЕЦ КАК ЦенаКупона,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Количество
		|		КОНЕЦ КАК Количество,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКД,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО
		|		КОНЕЦ КАК ДатаВторойЧастиРЕПО,
		|		УсловияСделокРЕПО.СтавкаРЕПО КАК Ставка,
		|		СделкаРЕПОДокумент.ВалютаСделки КАК ВалютаСделки,
		|		СделкаРЕПОДокумент.Ссылка КАК Основание,
		|		МАКСИМУМ(УсловияСделокРЕПОСрез.Период) КАК ПериодПоследнихУсловий,
		|		УсловияСделокРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО
		|	ИЗ
		|		РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|			ПО (УсловияСделокРЕПО.Активность)
		|				И УсловияСделокРЕПО.СделкаРЕПО = СделкаРЕПОДокумент.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПОСрез
		|			ПО (УсловияСделокРЕПОСрез.Активность)
		|				И УсловияСделокРЕПО.Организация = УсловияСделокРЕПОСрез.Организация
		|				И УсловияСделокРЕПО.СделкаРЕПО = УсловияСделокРЕПОСрез.СделкаРЕПО
		|				И УсловияСделокРЕПО.Рынок = УсловияСделокРЕПОСрез.Рынок
		|				И УсловияСделокРЕПО.ЦеннаяБумага = УсловияСделокРЕПОСрез.ЦеннаяБумага
		|				И УсловияСделокРЕПО.ЧастьСделкиРЕПО = УсловияСделокРЕПОСрез.ЧастьСделкиРЕПО
		|				И УсловияСделокРЕПО.Период > УсловияСделокРЕПОСрез.Период
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(УсловияСделокРЕПО.Регистратор) <> ТИП(Документ.СделкаРЕПО)
		|		И УсловияСделокРЕПО.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И УсловияСделокРЕПО.Организация = &Организация
		|		И УсловияСделокРЕПО.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|		И УсловияСделокРЕПО.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияСделокРЕПО.Период,
		|		УсловияСделокРЕПО.Регистратор,
		|		УсловияСделокРЕПО.СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|		КОНЕЦ,
		|		УсловияСделокРЕПО.Рынок,
		|		УсловияСделокРЕПО.ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Цена
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.ЦенаКупона
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Количество
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|		КОНЕЦ,
		|		УсловияСделокРЕПО.СтавкаРЕПО,
		|		СделкаРЕПОДокумент.ВалютаСделки,
		|		СделкаРЕПОДокумент.Ссылка,
		|		УсловияСделокРЕПО.ЧастьСделкиРЕПО,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Покупка (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Продажа (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Продажа (РЕПО ч.2)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Покупка (РЕПО ч.2)""
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО (УсловияСделокРЕПО.Активность)
		|			И ВложенныйЗапрос.ПериодПоследнихУсловий = УсловияСделокРЕПО.Период
		|			И ВложенныйЗапрос.Основание = УсловияСделокРЕПО.СделкаРЕПО
		|			И ВложенныйЗапрос.Рынок = УсловияСделокРЕПО.Рынок
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделокРЕПО.ЦеннаяБумага
		|			И ВложенныйЗапрос.ЧастьСделкиРЕПО = УсловияСделокРЕПО.ЧастьСделкиРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводЦенныхБумаг.Ссылка КАК Ссылка,
		|	ВводЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводЦенныхБумаг.Дата КАК Дата,
		|	ВводЦенныхБумаг.Дата КАК ДатаРасчетов,
		|	""Ввод ЦБ"" КАК ВидОперации,
		|	ВводЦенныхБумаг.Рынок КАК Рынок,
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.Количество) КАК Количество,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаРынок / ВводЦенныхБумагЦенныеБумаги.Количество КАК Цена,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок / ВводЦенныхБумагЦенныеБумаги.Количество КАК ЦенаКупона,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.СуммаРынок + ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок) КАК Сумма,
		|	ВводЦенныхБумаг.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ЦенныеБумагиДокументы
		|ИЗ
		|	Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|		ПО ВводЦенныхБумагЦенныеБумаги.Ссылка = ВводЦенныхБумаг.Ссылка
		|ГДЕ
		|	ВводЦенныхБумаг.Проведен
		|	И ВводЦенныхБумаг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВводЦенныхБумаг.Организация = &Организация
		|	И ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|	И ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводЦенныхБумаг.Ссылка,
		|	ВводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВводЦенныхБумаг.Дата,
		|	ВводЦенныхБумаг.Рынок,
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаРынок / ВводЦенныхБумагЦенныеБумаги.Количество,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок / ВводЦенныхБумагЦенныеБумаги.Количество,
		|	ВводЦенныхБумаг.Валюта,
		|	ВводЦенныхБумаг.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводЦенныхБумаг.Ссылка,
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Дата,
		|	ВыводЦенныхБумаг.Дата,
		|	""Вывод ЦБ"",
		|	ВыводЦенныхБумаг.Рынок,
		|	ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.Количество),
		|	ВыводЦенныхБумагЦенныеБумаги.СуммаРынок / ВыводЦенныхБумагЦенныеБумаги.Количество,
		|	ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок / ВыводЦенныхБумагЦенныеБумаги.Количество,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.СуммаРынок + ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок),
		|	ВыводЦенныхБумаг.Организация.ВалютаУчета
		|ИЗ
		|	Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|		ПО ВыводЦенныхБумагЦенныеБумаги.Ссылка = ВыводЦенныхБумаг.Ссылка
		|ГДЕ
		|	ВыводЦенныхБумаг.Проведен
		|	И ВыводЦенныхБумаг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВыводЦенныхБумаг.Организация = &Организация
		|	И ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|	И ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыводЦенныхБумаг.Ссылка,
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Дата,
		|	ВыводЦенныхБумаг.Рынок,
		|	ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ВыводЦенныхБумагЦенныеБумаги.СуммаРынок / ВыводЦенныхБумагЦенныеБумаги.Количество,
		|	ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок / ВыводЦенныхБумагЦенныеБумаги.Количество,
		|	ВыводЦенныхБумаг.Организация.ВалютаУчета,
		|	ВыводЦенныхБумаг.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеДивидендов.Ссылка,
		|	НачислениеДивидендов.СчетДоверительногоУправления,
		|	НачислениеДивидендов.Дата,
		|	НачислениеДивидендов.ДатаОплатыПлановая,
		|	""Начисление дивидендов"",
		|	НачислениеДивидендов.Рынок,
		|	НачислениеДивидендов.ЦеннаяБумага,
		|	НачислениеДивидендов.Количество,
		|	НачислениеДивидендов.Сумма / НачислениеДивидендов.Количество,
		|	0,
		|	НачислениеДивидендов.Сумма,
		|	НачислениеДивидендов.ВалютаОплаты
		|ИЗ
		|	Документ.НачислениеДивидендов КАК НачислениеДивидендов
		|ГДЕ
		|	НачислениеДивидендов.Проведен
		|	И НачислениеДивидендов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НачислениеДивидендов.Организация = &Организация
		|	И НачислениеДивидендов.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|	И НачислениеДивидендов.ЦеннаяБумага.Эмитент В(&Эмитенты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиДокументы.Ссылка КАК Ссылка,
		|	_СделкиДокументы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СделкиДокументы.ДатаОперации КАК ДатаОперации,
		|	_СделкиДокументы.ДатаРасчетов КАК ДатаРасчетов,
		|	_СделкиДокументы.ВидОперации КАК ВидОперации,
		|	_СделкиДокументы.Рынок КАК Рынок,
		|	_СделкиДокументы.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СделкиДокументы.Цена КАК Цена,
		|	_СделкиДокументы.ЦенаКупона КАК ЦенаКупона,
		|	_СделкиДокументы.Количество КАК Количество,
		|	_СделкиДокументы.Сумма КАК Сумма,
		|	_СделкиДокументы.КоличествоДней КАК КоличествоДней,
		|	_СделкиДокументы.Ставка КАК Ставка,
		|	_СделкиДокументы.ВалютаСделки КАК ВалютаСделки,
		|	_СделкиДокументы.Основание КАК Основание,
		|	"""" КАК РегНомер,
		|	0 КАК Номинал,
		|	НЕОПРЕДЕЛЕНО КАК Банк,
		|	_СделкиДокументы.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО
		|ПОМЕСТИТЬ _Объединение
		|ИЗ
		|	_СделкиДокументы КАК _СделкиДокументы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЦенныеБумагиДокументы.Ссылка,
		|	_ЦенныеБумагиДокументы.СчетДоверительногоУправления,
		|	_ЦенныеБумагиДокументы.Дата,
		|	_ЦенныеБумагиДокументы.ДатаРасчетов,
		|	_ЦенныеБумагиДокументы.ВидОперации,
		|	_ЦенныеБумагиДокументы.Рынок,
		|	_ЦенныеБумагиДокументы.ЦеннаяБумага,
		|	_ЦенныеБумагиДокументы.Цена,
		|	_ЦенныеБумагиДокументы.ЦенаКупона,
		|	_ЦенныеБумагиДокументы.Количество,
		|	_ЦенныеБумагиДокументы.Сумма,
		|	0,
		|	0,
		|	_ЦенныеБумагиДокументы.Валюта,
		|	_ЦенныеБумагиДокументы.Ссылка,
		|	"""",
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0
		|ИЗ
		|	_ЦенныеБумагиДокументы КАК _ЦенныеБумагиДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Объединение.Ссылка КАК Ссылка,
		|	_Объединение.СчетДоверительногоУправления КАК Портфель,
		|	_Объединение.СчетДоверительногоУправления.КодСчета КАК КодПортфеля,
		|	_Объединение.ДатаОперации КАК ДатаОперации,
		|	_Объединение.ДатаОперации КАК ВремяОперации,
		|	_Объединение.ДатаРасчетов КАК ДатаРасчетов,
		|	_Объединение.ВидОперации КАК ВидОперации,
		|	_Объединение.Рынок КАК Рынок,
		|	_Объединение.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФ.УправляющаяКомпания
		|		ИНАЧЕ _Объединение.Банк
		|	КОНЕЦ КАК Эмитент,
		|	ЕСТЬNULL(КодыВТорговыхСистемах.Код, _Объединение.РегНомер) КАК КодММВБ,
		|	ЕСТЬNULL(НоминалыЦенныхБумаг.Номинал, _Объединение.Номинал) КАК Номинал,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ _Объединение.РегНомер
		|	КОНЕЦ КАК РегНомер,
		|	_Объединение.Цена КАК Цена,
		|	_Объединение.ЦенаКупона КАК ЦенаКупона,
		|	_Объединение.Количество КАК Количество,
		|	_Объединение.Сумма КАК Сумма,
		|	_Объединение.КоличествоДней КАК КоличествоДней,
		|	_Объединение.Ставка КАК Ставка,
		|	_Объединение.ВалютаСделки КАК ВалютаСделки,
		|	_Объединение.Основание КАК Основание,
		|	_Объединение.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО
		|ИЗ
		|	_Объединение КАК _Объединение
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Объединение.ДатаОперации КАК ДатаОперации,
		|			_Объединение.ЦеннаяБумага КАК ЦеннаяБумага,
		|			КодыВТорговыхСистемах.ВидКода КАК ВидКода,
		|			ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
		|			МАКСИМУМ(КодыВТорговыхСистемах.Период) КАК ПериодКодаММВБ,
		|			МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала,
		|			МАКСИМУМ(РеквизитыПИФ.Период) КАК ПериодУправляющейКомпании
		|		ИЗ
		|			_Объединение КАК _Объединение
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыВТорговыхСистемах
		|				ПО _Объединение.ЦеннаяБумага = КодыВТорговыхСистемах.Объект
		|					И (ВЫБОР
		|						КОГДА ТИПЗНАЧЕНИЯ(_Объединение.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|							ТОГДА КодыВТорговыхСистемах.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)
		|						ИНАЧЕ КодыВТорговыхСистемах.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)
		|					КОНЕЦ)
		|					И _Объединение.ДатаОперации >= КодыВТорговыхСистемах.Период
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|				ПО _Объединение.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|					И _Объединение.ДатаОперации >= НоминалыЦенныхБумаг.Период
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ КАК РеквизитыПИФ
		|				ПО (ВЫРАЗИТЬ(_Объединение.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФ.ПаевойИнвестиционныйФонд)
		|					И _Объединение.ДатаОперации >= РеквизитыПИФ.Период
		|		ГДЕ
		|			НЕ(КодыВТорговыхСистемах.Период ЕСТЬ NULL
		|						И НоминалыЦенныхБумаг.Период ЕСТЬ NULL
		|						И РеквизитыПИФ.Период ЕСТЬ NULL)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Объединение.ЦеннаяБумага,
		|			_Объединение.ДатаОперации,
		|			КодыВТорговыхСистемах.ВидКода) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах КАК КодыВТорговыхСистемах
		|			ПО ВложенныйЗапрос.ЦеннаяБумага = КодыВТорговыхСистемах.Объект
		|				И ВложенныйЗапрос.ВидКода = КодыВТорговыхСистемах.ВидКода
		|				И ВложенныйЗапрос.ПериодКодаММВБ = КодыВТорговыхСистемах.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО ВложенныйЗапрос.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И ВложенныйЗапрос.ПериодНоминала = НоминалыЦенныхБумаг.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ КАК РеквизитыПИФ
		|			ПО ВложенныйЗапрос.ПаевойИнвестиционныйФонд = РеквизитыПИФ.ПаевойИнвестиционныйФонд
		|				И ВложенныйЗапрос.ПериодУправляющейКомпании = РеквизитыПИФ.Период
		|		ПО _Объединение.ЦеннаяБумага = ВложенныйЗапрос.ЦеннаяБумага
		|			И _Объединение.ДатаОперации = ВложенныйЗапрос.ДатаОперации";
	#КонецОбласти
	
	Операции = Запрос.Выполнить().Выгрузить();
	
	Если Операции.Количество() > 0 Тогда
		ВыестиСделки(Операции, ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыестиСделки(Операции, ДокументРезультат)
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьЗаголовок.Параметры.ДатаОтчета	= Формат(Период, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Организация	= Организация;
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	Для Каждого Операция Из Операции Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Операция);
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

// Функция возвращает массив дат, состоящий из рабочих и предпраздничных дней.
// указанного календаря
//
// Параметры:
//	- Календарь		- тип СправочникСсылка.Календари
//	- НачалоПериода	- тип Дата
//	- КонецПериода	- тип Дата
//
Функция ПолучитьРабочиеДниПериода(Календарь, НачалоПериода, КонецПериода) Экспорт
	
	Если НЕ Справочники.Календари.КалендарьЗаполненЗаПериод(Календарь, НачалоПериода, КонецПериода) Тогда
		ВызватьИсключение "Календарь " + Календарь + " не заполнен за период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеКалендаря.Дата КАК РабочийДень
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|ГДЕ
	|	ДанныеКалендаря.Календарь = &Календарь
	|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))"
	);
	
	Запрос.УстановитьПараметр("Календарь",     Календарь);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РабочийДень");
	
КонецФункции

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
